TestTask/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

TestTask/InformationRegisters/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

TestTask/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Статус = ПрочитатьСтатус();
	ПрочитатьИсториюСтатусов();
КонецПроцедуры

&НаСервере
Функция ПрочитатьСтатус()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыКонтрагентовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СтатусыКонтрагентовСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыКонтрагентовСрезПоследних.Период";
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗаписатьСтатус(ОбъектСсылка)
	
	// Проверяем - изменил ли пользователь статус?
	Если Статус <> ПрочитатьСтатус() Тогда
		
		МенеджерЗаписи = РегистрыСведений.СтатусыКонтрагентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Контрагент = ОбъектСсылка;
		МенеджерЗаписи.Статус = Статус;
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьСтатус(ТекущийОбъект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИсториюСтатусов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыКонтрагентов.Период КАК Период,
		|	СтатусыКонтрагентов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
		|ГДЕ
		|	СтатусыКонтрагентов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ИсторияСтатусов.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры
